In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("bank-additional-full.csv",sep=";")

In [3]:
data.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [4]:
data["y"].value_counts()

no     36548
yes     4640
Name: y, dtype: int64

In [5]:
data_no=data[data.y=="no"].head(4640)

In [6]:
data_yes=data[data.y=="yes"]

In [7]:
df=pd.concat([data_no,data_yes],axis="index")

In [8]:
df["y"].value_counts()

no     4640
yes    4640
Name: y, dtype: int64

In [9]:
df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'month', 'day_of_week', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'emp.var.rate', 'cons.price.idx',
       'cons.conf.idx', 'euribor3m', 'nr.employed', 'y'],
      dtype='object')

In [10]:
df.age.unique()

array([56, 57, 37, 40, 45, 59, 41, 24, 25, 29, 35, 54, 46, 50, 39, 30, 55,
       49, 34, 52, 58, 32, 38, 44, 42, 60, 53, 47, 51, 48, 33, 31, 43, 36,
       28, 27, 26, 22, 23, 20, 21, 70, 66, 88, 19, 77, 68, 73, 62, 80, 63,
       82, 61, 69, 67, 71, 75, 64, 78, 65, 85, 79, 81, 18, 74, 76, 17, 87,
       72, 83, 98, 86, 84, 92, 89], dtype=int64)

In [11]:
df.job.unique()

array(['housemaid', 'services', 'admin.', 'blue-collar', 'technician',
       'retired', 'management', 'unemployed', 'self-employed', 'unknown',
       'entrepreneur', 'student'], dtype=object)

In [12]:
df.job.value_counts()

admin.           2293
blue-collar      2009
technician       1354
services          868
management        680
retired           572
student           321
self-employed     291
entrepreneur      291
unemployed        254
housemaid         248
unknown            99
Name: job, dtype: int64

In [13]:
df["job"].replace({"NAN":np.nan},inplace=True)

In [14]:
df.job.isna().sum()

0

In [15]:
df["job"].dropna(inplace=True)

In [16]:
df.marital.unique()

array(['married', 'single', 'divorced', 'unknown'], dtype=object)

In [17]:
df.marital.value_counts()

married     5703
single      2556
divorced    1000
unknown       21
Name: marital, dtype: int64

In [18]:
def drop(d):
    d.replace({"unknown":np.NaN},inplace=True)
    d.dropna(inplace=True)

In [19]:
drop(df["marital"])

In [20]:
df.marital.isna().sum()

0

In [21]:
df['loan'].value_counts()

no         7682
yes        1338
unknown     260
Name: loan, dtype: int64

In [22]:
drop(df["loan"])

In [23]:
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [24]:
from sklearn import tree

In [ ]:
tree.DecisionTreeClassifier()